{
  "202005292109": {
    "time": "2020-05-29 21:09:17 -0500",
    "text": "A thought made via an ERB template"
  },
  "202005300025": {
    "time": "2020-05-30 00:25:39 -0500",
    "text": "I wonder what the day before looks like for someone who riots through the night."
  },
  "202005301608": {
    "time": "2020-05-30 16:08:33 -0500",
    "text": "I can't believe SpaceX just successfully inserted men into orbit"
  },
  "202005311204": {
    "time": "2020-05-31 12:04:46 -0500",
    "text": "Covet's 'Falkor' is great on loop. Fun background while watching the Dragon Capsule board the ISS!"
  },
  "202005311553": {
    "time": "2020-05-31 15:53:39 -0500",
    "text": "Such a nice day outside. I've been taking turns writing this site up, playing bass, talking to people online, and taking nature walks. Gonna be refreshed tomorrow"
  },
  "202006021753": {
    "time": "2020-06-02 17:53:16 -0500",
    "text": "I added an extra half pint of half cream to the masala. Predictably awesome!"
  },
  "202006041244": {
    "time": "2020-06-04 12:44:35 -0500",
    "text": "Exercise with Toby yesterday kicked my ass: my legs are so sore it hurts to sit!"
  },
  "202006051015": {
    "time": "2020-06-05 10:15:27 -0500",
    "text": "Had a memorable experience at the BLM demonstration downtown yesterday. Also, the anarchists with the tent are always the coolest."
  },
  "202006051016": {
    "time": "2020-06-05 10:16:52 -0500",
    "text": "Optimistic for my brother as he makes big changes in his life. Very proud!"
  },
  "202006061631": {
    "time": "2020-06-06 16:31:34 -0500",
    "text": "Its humid and warm today: reminds me of Shanghai."
  },
  "202006071027": {
    "time": "2020-06-07 10:27:18 -0500",
    "text": "Sakura.css is probably how I'll go for styling on the site. Futzing around with the nav at the moment."
  },
  "202006071333": {
    "time": "2020-06-07 13:33:52 -0500",
    "text": "Got a songbook for the stand: should help my sight reading, which I'm frankly terrible at."
  },
  "202006071734": {
    "time": "2020-06-07 17:34:28 -0500",
    "text": "Site is finally looking presentable. Still is only offline though, and I'd like to write up a blog post for its debut first."
  },
  "202006072028": {
    "time": "2020-06-07 20:28:50 -0500",
    "text": "Settling down to relax the last few hours of the weekend. Pretty productive weekend!"
  },
  "202006072229": {
    "time": "2020-06-07 22:29:57 -0500",
    "text": "Way too short of a weekend: my legs are still hurting from Wednesday."
  },
  "202006072231": {
    "time": "2020-06-07 22:31:07 -0500",
    "text": "I'm glad to start working out again, but definitely taking it down a notch next time."
  },
  "202006080933": {
    "time": "2020-06-08 09:33:20 -0500",
    "text": "First thought from work"
  },
  "202006082002": {
    "time": "2020-06-08 20:02:03 -0500",
    "text": "Autopushing commits to master when making a thought feels exciting, but that's because it makes me uneasy, lol."
  },
  "202006082022": {
    "time": "2020-06-08 20:22:03 -0500",
    "text": "Storm clouds rolling in it looks like: some rain to relieve how hot the past few days have been!"
  },
  "202006090944": {
    "time": "2020-06-09 09:44:06 -0500",
    "text": "I'm not very good at gardening in pots, but I've not killed any plants yet so I'll count that as a win"
  },
  "202006091034": {
    "time": "2020-06-09 10:34:31 -0500",
    "text": "I believe there is a threshold of media consumption past which one becomes less and less accurately informed about the world."
  },
  "202006091539": {
    "time": "2020-06-09 15:39:07 -0500",
    "text": "I'm excited to go visit Pawn & Pint for the first time since the pandemic"
  },
  "202006100728": {
    "time": "2020-06-10 07:28:42 -0500",
    "text": "Pawn and Pint last night was great: I played Magic for the first time in almost ten years with some new folks."
  },
  "202006100815": {
    "time": "2020-06-10 08:15:00 -0500",
    "text": "Looking forward to a picnic at lunch today with my coworkers: been a bit too long since face-to-face."
  },
  "202006101902": {
    "time": "2020-06-10 19:02:19 -0500",
    "text": "Currently attending a D&D session on Roll20, while myself at Pawn and Pint. Wild!"
  },
  "202006110841": {
    "time": "2020-06-11 08:41:00 -0500",
    "text": "I'm very lucky that my friend was learning how to mix drinks last evening, but the sugar in them was not good for my ketosis. Worth it though!"
  },
  "202006130715": {
    "time": "2020-06-13 07:15:38 -0500",
    "text": "Busy day ahead: helping out brother, going clothes shopping, going grocery shopping, and then hosting a D&D night at my house!"
  },
  "202006132000": {
    "time": "2020-06-13 20:00:07 -0500",
    "text": "Did a ton of chores today, with the general aim of getting my wardrobe reset. It's draining to do, but pays dividends in presenting yourself to others."
  },
  "202006140933": {
    "time": "2020-06-14 09:33:16 -0500",
    "text": "Just passed the Mun in Kerbal Space Program. It has been a long while since I've played, so getting used to the new aerodynamics is taking some effort!"
  },
  "202006151241": {
    "time": "2020-06-15 12:41:25 -0500",
    "text": "The only thing harder than meeting new people here is meeting those people again"
  },
  "202006160847": {
    "time": "2020-06-16 08:47:49 -0500",
    "text": "The hardest bad mood to shake is when it's caused by vague threats to your self-development and well-being that you can't control"
  },
  "202006161255": {
    "time": "2020-06-16 12:55:07 -0500",
    "text": "Yarrow sticks are cool and all, but I prefer `puts %w[☰ ☱ ☲ ☳ ☴ ☵ ☶ ☷ ].sample(2)`"
  },
  "202006170745": {
    "time": "2020-06-17 07:45:40 -0500",
    "text": "Wednesdays are fast becoming my favorite day of the week: work is usually smooth, I get a workout with my best friend from college, and I get to go to my favorite bar to hang out with cool people over a drink or game of D&D"
  },
  "202006190741": {
    "time": "2020-06-19 07:41:14 -0500",
    "text": "I heard the term 'critical feeling' for the first time yesterday, and the concept's grown on me quite a bit. It draws a parallel to 'critical thinking', where you source and try to understand your emotions, to gain maturity in heart, as opposed to mind."
  },
  "202006201131": {
    "time": "2020-06-20 11:31:09 -0500",
    "text": "Unfortunately, TIC-80 doesn't have very good capabilites on touch-based mobile devices: Pico8's gamepad overlay seems to be better paradigm for now."
  },
  "202006202231": {
    "time": "2020-06-20 22:31:44 -0500",
    "text": "Just had a great time hosting my D&D group at my house for the first time since the lockdowns. They delved; they looted; they got trapped!"
  },
  "202006211211": {
    "time": "2020-06-21 12:11:02 -0500",
    "text": "What a nice day out. Going to enjoy brunch at P&P, then hang out with my Mom and Brother over a backyard bratwurst"
  },
  "202006220837": {
    "time": "2020-06-22 08:37:56 -0500",
    "text": "My master todo file has gotten so long its breaking the highlighting of my editor. One file for almost 5 years of daily activities!"
  },
  "202006230827": {
    "time": "2020-06-23 08:27:33 -0500",
    "text": "The consistency of my days this year (same place, same schedule) highlights to me the fact that human energy really is subject to an ebb and flow tied more to the spirit than real stimulus. Today I'm feeling a bit thin-spirited."
  },
  "202006241857": {
    "time": "2020-06-24 18:57:01 -0500",
    "text": "People are always pretty surprising if you can get them to talk about themselves: met a voice actor today!"
  },
  "202006270824": {
    "time": "2020-06-27 08:24:37 -0500",
    "text": "Been bedeviled by indigestion the past few days. Really cutting into my sleep :-("
  },
  "202006300730": {
    "time": "2020-06-30 07:30:57 -0500",
    "text": "Woke up in a great mood today: ready to tackle the world!"
  },
  "202007010738": {
    "time": "2020-07-01 07:38:17 -0500",
    "text": "Colonel just made a slinky escape from my house when I left the front door barely unlatched. Took a second to find him and bring him back!"
  },
  "202007021315": {
    "time": "2020-07-02 13:15:16 -0500",
    "text": "I wish I could turn off the overthinker in me sometimes: it inevitably has the same conclusion as my gut feeling, but spends a lot more time doing so"
  },
  "202007031126": {
    "time": "2020-07-03 11:26:22 -0500",
    "text": "A day off! Got a blog post done and now gonna do some chores and finalize some plans for the weekend"
  },
  "202007041007": {
    "time": "2020-07-04 10:07:45 -0500",
    "text": "I worry about how effective phones are at being a portal away from the here-and-now: it's a k-hole of attention."
  },
  "202007051510": {
    "time": "2020-07-05 15:10:15 -0500",
    "text": "Just finished an hour laying out in a grassy field working on my tan. Sure a lovely day!"
  },
  "202007080847": {
    "time": "2020-07-08 08:47:11 -0500",
    "text": "Feeling a bit nervous about today: gotta keep a positive mindset!"
  },
  "202007091940": {
    "time": "2020-07-09 19:40:51 -0500",
    "text": "Brainstorming how to be social during a pandemic is a bit like figuring out what you can create with an egg and a piece of string"
  },
  "202007101911": {
    "time": "2020-07-10 19:11:15 -0500",
    "text": "I'm going to check out the night scene near 75th and see what's open tonight. After all that has happened, it's a valid question to ask: 'Where is Waldo' :-P"
  },
  "202007111240": {
    "time": "2020-07-11 12:40:06 -0500",
    "text": "Ran for an hour today: it's hot out there!"
  },
  "202007181659": {
    "time": "2020-07-18 16:59:41 -0500",
    "text": "Was on a roof most of this morning: gets hot out there 0_o"
  },
  "202007192235": {
    "time": "2020-07-19 22:35:45 -0500",
    "text": "I practiced so much 12-bar shuffle today. Really aiming to be passably good for the live jam on Tuesday"
  },
  "202007212346": {
    "time": "2020-07-21 23:46:01 -0500",
    "text": "Just finished my first every live performance! Wasn't terribad, but looking forward to improving next week ;-)"
  },
  "202007271220": {
    "time": "2020-07-27 12:20:28 -0500",
    "text": "Bought an acoustic bass guitar - was great to be able to play in the park this weekend!"
  },
  "202007281623": {
    "time": "2020-07-28 16:23:52 -0500",
    "text": "Another jam tonight - hafta admit I feel a bit dull heading into it, hope I perk up"
  },
  "202007290731": {
    "time": "2020-07-29 07:31:42 -0500",
    "text": "Been reading Slaughterhouse Five, about halfway through. I like it, but I loved Cat's Cradle."
  },
  "202007302143": {
    "time": "2020-07-30 21:43:41 -0500",
    "text": "So rainy this week. I didn't mind the heat and sun, hope it comes back this weekend"
  },
  "202008011102": {
    "time": "2020-08-01 11:02:57 -0500",
    "text": "Taking care of my potted balcony plants is like managing an intensive care unit"
  },
  "202008030745": {
    "time": "2020-08-03 07:45:01 -0500",
    "text": "'Finally', the best way to fight evil is to make energetic progress in the good. - I Ching"
  },
  "202008041531": {
    "time": "2020-08-04 15:31:38 -0500",
    "text": "Maj6 is a very handsome chord over the 12-bar blues"
  },
  "202008051609": {
    "time": "2020-08-05 16:09:27 -0500",
    "text": "Going out to places and putting yourself out there is probably the fundamental civic duty - and I don't think being on the internet counts"
  },
  "202008111052": {
    "time": "2020-08-11 10:52:39 -0500",
    "text": "Definitely fishing around for a second serious hobby: leaning on the bass a bit overmuch, some small risk of burnout"
  },
  "202008111356": {
    "time": "2020-08-11 13:56:03 -0500",
    "text": "Just as the distinction between the 'silent' and 'boomer' generation is only brought out when convenient, I think 'Xers' are starting to find themselves lumped in with the 'boomers' now."
  }
}